In [5]:
# Import everything from datascience, and import numpy, but call it "np"
from datascience import *
import numpy as np

In [10]:
# Not super important for the example.  This cell sets up a table that we'll use further on in the code.
names = ['zero', 'one', 'two', 'three',' four', 'five']
values = np.arange(6)
t = Table().with_columns('names', names, 'values',values)

In [28]:
# Hmm... how do we select some values from the table?
?t.select

In [29]:
t.select('names')

names
zero
one
two
three
 four
five

In [36]:
# Count the total number of rows
t.num_rows

6

In [42]:
# Access documentation for filtering rows from a table object
?t.where

In [43]:
# List all the filters that can be used with the .are object
#  These are the functions that are called on the .are object to determine which rows are returned.
?datascience.predicates.are

In [44]:
# Get the rows with values less than 3
t.where('values', are.below(3))

names | values
zero  | 0
one   | 1
two   | 2

In [53]:
# Get the rows with names that contain a letter 't' and stick then in a variable called "rows_with_t"
rows_with_t = t.where('names', are.containing('t'))
# Show the table
rows_with_t.show()
# Ca
num_rows_with_t = rows_with_t.num_rows
print(f'There are {num_rows_with_t} rows with a name containing t')

There are 2 rows with a name containing t

In [47]:
# Chain multiple filters together (get all rows with values less than 3 and also have a letter 't')
t.where('names', are.containing('t')).where('values', are.below(3))

names | values
two   | 2